<template>
      <span class="contextMenu" :class="{contextOpened:isOpen}">
        <span class="download">
			      <download-btn :item-data="itemData"></download-btn>
           <span class="text">دانلود</span>
        </span>
    <span class="sendToTelegram" @click="$utils.openSheet($root.$refs.downloadSheet)">
                <svg width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_232_59)">
                <path
                    d="M9.02455 14.5485L8.64409 19.8998C9.18843 19.8998 9.42418 19.666 9.70689 19.3852L12.2589 16.9462L17.547 20.8188C18.5168 21.3593 19.2001 21.0747 19.4618 19.9266L22.9328 3.66179L22.9338 3.66083C23.2414 2.22717 22.4153 1.66654 21.4704 2.01825L1.06751 9.82963C-0.324949 10.3701 -0.303865 11.1464 0.830801 11.4981L6.04701 13.1205L18.1632 5.53917C18.7334 5.16158 19.2519 5.3705 18.8254 5.74808L9.02455 14.5485Z"
                    fill="#039BE5"/>
                </g>
                <defs>
                <clipPath id="clip0_232_59">
                <rect width="23" height="23" fill="white"/>
                </clipPath>
                </defs>
                </svg>
                <span class="text">ارسال به تلگرام</span>
    </span>
    <span class="addToPlaylist" @click.stop="$emit('addPlaylist')">
                <svg width="30" height="23" viewBox="0 0 30 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M0.999996 3.95288L6.99927 4.04639" stroke="#E0E0E0" stroke-width="2" stroke-linecap="round"/>
                <path d="M4 1V7" stroke="#E0E0E0" stroke-width="2" stroke-linecap="round"/>
                <path
                    d="M25.9696 2.87611L22.773 1.13646C22.0364 0.735704 21.1327 1.26565 21.1327 2.10096V14.2367H18.9131C16.4796 14.2367 14.4998 16.2024 14.4998 18.6184C14.4998 20.9902 16.4265 23 18.9353 23C21.3687 23 23.3486 21.0343 23.3486 18.6184C23.3486 17.8521 23.3486 4.68394 23.3486 3.95835L24.9046 4.8054C26.669 5.76589 27.7654 7.59979 27.7654 9.59152V11.9459C27.7654 12.5532 28.2613 13.0459 28.8733 13.0459C29.4853 13.0459 29.9812 12.5532 29.9812 11.9459V9.59152C29.9812 6.79599 28.444 4.22303 25.9696 2.87611ZM21.1324 18.6184C21.1324 19.7891 20.1875 20.8 18.9131 20.8C17.7015 20.8 16.7156 19.8212 16.7156 18.6184C16.7156 17.4155 17.7015 16.4367 18.9131 16.4367H21.1324V18.6184Z"
                    fill="#E0E0E0"/>
                <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M25.1486 4.94634C26.7695 5.93839 27.7654 7.69327 27.7654 9.59152V11.9459C27.7654 12.5532 28.2613 13.0459 28.8733 13.0459C29.4853 13.0459 29.9812 12.5532 29.9812 11.9459V9.59152C29.9812 6.79599 28.444 4.22303 25.9696 2.87611L22.773 1.13646C22.4607 0.966555 22.1184 0.963936 21.8276 1.08095C21.7274 1.1213 21.6332 1.17587 21.5486 1.24271C21.2997 1.43926 21.1327 1.74189 21.1327 2.10096V14.2367H18.9131C16.4796 14.2367 14.4998 16.2024 14.4998 18.6184C14.4998 20.9902 16.4265 23 18.9353 23C21.3687 23 23.3486 21.0343 23.3486 18.6184V3.95835L24.9046 4.8054C24.9874 4.85048 25.0688 4.89749 25.1486 4.94634ZM18.9131 20.8C20.1875 20.8 21.1324 19.7891 21.1324 18.6184V16.4367H18.9131C17.7015 16.4367 16.7156 17.4155 16.7156 18.6184C16.7156 19.8212 17.7015 20.8 18.9131 20.8Z"
                      fill="#E0E0E0"/>
                <path d="M1.50024 11H16.0002" stroke="#E0E0E0" stroke-width="2" stroke-linecap="round"/>
                <path d="M1.50024 18H11.5002" stroke="#E0E0E0" stroke-width="2" stroke-linecap="round"/>
                <path d="M10.5 4.00049H16" stroke="#E0E0E0" stroke-width="2" stroke-linecap="round"/>
                </svg>
 <span class="text">افزودن به پلی لیست</span>
    </span>
    <span class="shareTrack">
                 <svg width="22" height="22" viewBox="0 0 22 22" fill="none"
                      xmlns="http://www.w3.org/2000/svg">
                 <path
                     d="M17.6404 14.2812C16.602 14.2812 15.6721 14.7548 15.0555 15.4973L12.4414 14.1972C12.0551 14.0051 11.5862 14.1624 11.394 14.5488C11.2019 14.9351 11.3593 15.404 11.7457 15.5962L14.3637 16.8982C14.3096 17.1372 14.281 17.3856 14.281 17.6406C14.281 19.493 15.788 21 17.6404 21C19.4927 21 20.9998 19.493 20.9998 17.6406C20.9998 15.7882 19.4927 14.2812 17.6404 14.2812ZM17.6404 19.4375C16.6496 19.4375 15.8435 18.6314 15.8435 17.6406C15.8435 17.3949 15.8931 17.1606 15.9828 16.9471C16.0019 16.9187 16.0195 16.8887 16.0352 16.8571C16.0519 16.8236 16.0659 16.7894 16.0775 16.7548C16.3867 16.2112 16.9714 15.8437 17.6404 15.8437C18.6312 15.8437 19.4373 16.6498 19.4373 17.6406C19.4373 18.6314 18.6312 19.4375 17.6404 19.4375Z"
                     fill="#E0E0E0" stroke="#E0E0E0" stroke-width="0.2"/>
                 <path
                     d="M17.6406 1C15.7883 1 14.2813 2.50699 14.2813 4.35938C14.2813 4.61825 14.3107 4.87036 14.3664 5.11254L6.93126 8.84106C6.31454 8.10759 5.39047 7.64063 4.35938 7.64063C2.50703 7.64063 1 9.14763 1 11C1 12.8524 2.50703 14.3594 4.35938 14.3594C5.38602 14.3594 6.30657 13.8965 6.92325 13.1685L8.1847 13.8104C8.29821 13.8682 8.41919 13.8956 8.53841 13.8956C8.82302 13.8956 9.09739 13.7395 9.23532 13.4685C9.43103 13.084 9.27798 12.6136 8.89341 12.4179L7.62868 11.7743C7.68759 11.5256 7.71876 11.2664 7.71876 11C7.71876 10.7379 7.6886 10.4828 7.63153 10.2379L15.0628 6.51126C15.6796 7.24884 16.6063 7.71876 17.6406 7.71876C19.493 7.71876 21 6.21176 21 4.35938C21 2.50699 19.493 1 17.6406 1ZM4.35938 12.7969C3.3686 12.7969 2.5625 11.9908 2.5625 11C2.5625 10.0092 3.3686 9.20314 4.35938 9.20314C5.35016 9.20314 6.15626 10.0092 6.15626 11C6.15626 11.9908 5.35016 12.7969 4.35938 12.7969ZM17.6406 6.15626C16.6499 6.15626 15.8438 5.35016 15.8438 4.35938C15.8438 3.3686 16.6499 2.5625 17.6406 2.5625C18.6314 2.5625 19.4375 3.3686 19.4375 4.35938C19.4375 5.35016 18.6314 6.15626 17.6406 6.15626Z"
                     fill="#E0E0E0" stroke="#E0E0E0" stroke-width="0.2"/>
                 </svg>
 <span class="text">اشتراک آهنگ</span>
    </span>
		</span>
</template>

<script>
import DownloadBtn from "@/components/includes/Elements/MusicList/downloadBtn.vue";

export default {
  name: "contextMenu",
  components: {DownloadBtn},
  props: {
    isOpen: Boolean,
    itemData: Object
  },
}
</script>

<style scoped>


.contextMenu {
  transform: scale(0.8);
  opacity: 0;
  transition: 0.3s all;
  position: absolute;
  top: 15px;
  right: 10px;
  /* margin-top: 40px; */
  /* right: 0px; */
  border-radius: 10px 0px 10px 10px;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: flex-start;
  padding: 5px 15px;
  background-color: #303030;
  z-index: -1;
  direction: rtl;
  height:0px;
  overflow:hidden;
}


.contextOpened {
  transition: 0.3s all;
  opacity: 1;
  /* transform: scale(1); */
  z-index: 1000001;
  height: auto;
  overflow: visible;
}


.contextMenu span {
  display: flex;
  align-items: center;
  font-size: 16px;
  font-weight: 200;
  margin: 5px 0px;

}

.contextMenu svg {
  vertical-align: middle;
  width: 22px;
  height: 22px;
  position: relative;
}


.contextMenu .text {
  margin-right:10px;
}
</style>